docs/k6-runs/before-journey.txt

         /\      Grafana   /ΓÇ╛ΓÇ╛/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ΓÇ╛ΓÇ╛\ 
  /          \   |   (  |  (ΓÇ╛)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: tests/load/journey.js
        output: -

     scenarios: (100.00%) 1 scenario, 15 max VUs, 3m30s max duration (incl. graceful stop):
              * default: Up to 15 looping VUs for 3m0s over 4 stages (gracefulRampDown: 30s, gracefulStop: 30s)


running (0m01.0s), 01/15 VUs, 0 complete and 0 interrupted iterations
default   [   1% ] 01/15 VUs  0m01.0s/3m00.0s

running (0m02.0s), 01/15 VUs, 0 complete and 0 interrupted iterations
default   [   1% ] 01/15 VUs  0m02.0s/3m00.0s

running (0m03.0s), 01/15 VUs, 0 complete and 0 interrupted iterations
default   [   2% ] 01/15 VUs  0m03.0s/3m00.0s

running (0m04.0s), 01/15 VUs, 0 complete and 0 interrupted iterations
default   [   2% ] 01/15 VUs  0m04.0s/3m00.0s

running (0m05.0s), 01/15 VUs, 0 complete and 0 interrupted iterations
default   [   3% ] 01/15 VUs  0m05.0s/3m00.0s

running (0m06.0s), 01/15 VUs, 0 complete and 0 interrupted iterations
default   [   3% ] 01/15 VUs  0m06.0s/3m00.0s

running (0m07.0s), 01/15 VUs, 1 complete and 0 interrupted iterations
default   [   4% ] 01/15 VUs  0m07.0s/3m00.0s

running (0m08.0s), 02/15 VUs, 1 complete and 0 interrupted iterations
default   [   4% ] 02/15 VUs  0m08.0s/3m00.0s

running (0m09.0s), 02/15 VUs, 1 complete and 0 interrupted iterations
default   [   5% ] 02/15 VUs  0m09.0s/3m00.0s

running (0m10.0s), 02/15 VUs, 1 complete and 0 interrupted iterations
default   [   6% ] 02/15 VUs  0m10.0s/3m00.0s

running (0m11.0s), 02/15 VUs, 1 complete and 0 interrupted iterations
default   [   6% ] 02/15 VUs  0m11.0s/3m00.0s

running (0m12.0s), 02/15 VUs, 1 complete and 0 interrupted iterations
default   [   7% ] 02/15 VUs  0m12.0s/3m00.0s

running (0m13.0s), 02/15 VUs, 1 complete and 0 interrupted iterations
default   [   7% ] 02/15 VUs  0m13.0s/3m00.0s

running (0m14.0s), 02/15 VUs, 1 complete and 0 interrupted iterations
default   [   8% ] 02/15 VUs  0m14.0s/3m00.0s

running (0m15.0s), 02/15 VUs, 1 complete and 0 interrupted iterations
default   [   8% ] 02/15 VUs  0m15.0s/3m00.0s

running (0m16.0s), 03/15 VUs, 2 complete and 0 interrupted iterations
default   [   9% ] 03/15 VUs  0m16.0s/3m00.0s

running (0m17.0s), 03/15 VUs, 2 complete and 0 interrupted iterations
default   [   9% ] 03/15 VUs  0m17.0s/3m00.0s

running (0m18.0s), 03/15 VUs, 2 complete and 0 interrupted iterations
default   [  10% ] 03/15 VUs  0m18.0s/3m00.0s

running (0m19.0s), 03/15 VUs, 3 complete and 0 interrupted iterations
default   [  11% ] 03/15 VUs  0m19.0s/3m00.0s

running (0m20.0s), 03/15 VUs, 3 complete and 0 interrupted iterations
default   [  11% ] 03/15 VUs  0m20.0s/3m00.0s

running (0m21.0s), 03/15 VUs, 4 complete and 0 interrupted iterations
default   [  12% ] 03/15 VUs  0m21.0s/3m00.0s

running (0m22.0s), 03/15 VUs, 5 complete and 0 interrupted iterations
default   [  12% ] 03/15 VUs  0m22.0s/3m00.0s

running (0m23.0s), 04/15 VUs, 5 complete and 0 interrupted iterations
default   [  13% ] 04/15 VUs  0m23.0s/3m00.0s

running (0m24.0s), 04/15 VUs, 5 complete and 0 interrupted iterations
default   [  13% ] 04/15 VUs  0m24.0s/3m00.0s

running (0m25.0s), 04/15 VUs, 5 complete and 0 interrupted iterations
default   [  14% ] 04/15 VUs  0m25.0s/3m00.0s

running (0m26.0s), 04/15 VUs, 6 complete and 0 interrupted iterations
default   [  14% ] 04/15 VUs  0m26.0s/3m00.0s

running (0m27.0s), 04/15 VUs, 6 complete and 0 interrupted iterations
default   [  15% ] 04/15 VUs  0m27.0s/3m00.0s

running (0m28.0s), 04/15 VUs, 6 complete and 0 interrupted iterations
default   [  16% ] 04/15 VUs  0m28.0s/3m00.0s

running (0m29.0s), 04/15 VUs, 7 complete and 0 interrupted iterations
default   [  16% ] 04/15 VUs  0m29.0s/3m00.0s

running (0m30.0s), 04/15 VUs, 7 complete and 0 interrupted iterations
default   [  17% ] 04/15 VUs  0m30.0s/3m00.0s

running (0m31.0s), 05/15 VUs, 7 complete and 0 interrupted iterations
default   [  17% ] 05/15 VUs  0m31.0s/3m00.0s

running (0m32.0s), 05/15 VUs, 10 complete and 0 interrupted iterations
default   [  18% ] 05/15 VUs  0m32.0s/3m00.0s

running (0m33.0s), 05/15 VUs, 10 complete and 0 interrupted iterations
default   [  18% ] 05/15 VUs  0m33.0s/3m00.0s

running (0m34.0s), 05/15 VUs, 10 complete and 0 interrupted iterations
default   [  19% ] 05/15 VUs  0m34.0s/3m00.0s

running (0m35.0s), 05/15 VUs, 11 complete and 0 interrupted iterations
default   [  19% ] 05/15 VUs  0m35.0s/3m00.0s

running (0m36.0s), 05/15 VUs, 12 complete and 0 interrupted iterations
default   [  20% ] 05/15 VUs  0m36.0s/3m00.0s

running (0m37.0s), 06/15 VUs, 12 complete and 0 interrupted iterations
default   [  21% ] 06/15 VUs  0m37.0s/3m00.0s

running (0m38.0s), 06/15 VUs, 13 complete and 0 interrupted iterations
default   [  21% ] 06/15 VUs  0m38.0s/3m00.0s

running (0m39.0s), 06/15 VUs, 14 complete and 0 interrupted iterations
default   [  22% ] 06/15 VUs  0m39.0s/3m00.0s

running (0m40.0s), 06/15 VUs, 14 complete and 0 interrupted iterations
default   [  22% ] 06/15 VUs  0m40.0s/3m00.0s

running (0m41.0s), 06/15 VUs, 15 complete and 0 interrupted iterations
default   [  23% ] 06/15 VUs  0m41.0s/3m00.0s

running (0m42.0s), 06/15 VUs, 15 complete and 0 interrupted iterations
default   [  23% ] 06/15 VUs  0m42.0s/3m00.0s

running (0m43.0s), 07/15 VUs, 16 complete and 0 interrupted iterations
default   [  24% ] 07/15 VUs  0m43.0s/3m00.0s

running (0m44.0s), 07/15 VUs, 16 complete and 0 interrupted iterations
default   [  24% ] 07/15 VUs  0m44.0s/3m00.0s

running (0m45.0s), 07/15 VUs, 18 complete and 0 interrupted iterations
default   [  25% ] 07/15 VUs  0m45.0s/3m00.0s

running (0m46.0s), 07/15 VUs, 22 complete and 0 interrupted iterations
default   [  26% ] 07/15 VUs  0m46.0s/3m00.0s

running (0m47.0s), 07/15 VUs, 22 complete and 0 interrupted iterations
default   [  26% ] 07/15 VUs  0m47.0s/3m00.0s

running (0m48.0s), 07/15 VUs, 23 complete and 0 interrupted iterations
default   [  27% ] 07/15 VUs  0m48.0s/3m00.0s

running (0m49.0s), 08/15 VUs, 23 complete and 0 interrupted iterations
default   [  27% ] 08/15 VUs  0m49.0s/3m00.0s

running (0m50.0s), 08/15 VUs, 23 complete and 0 interrupted iterations
default   [  28% ] 08/15 VUs  0m50.0s/3m00.0s

running (0m51.0s), 08/15 VUs, 26 complete and 0 interrupted iterations
default   [  28% ] 08/15 VUs  0m51.0s/3m00.0s

running (0m52.0s), 08/15 VUs, 26 complete and 0 interrupted iterations
default   [  29% ] 08/15 VUs  0m52.0s/3m00.0s

running (0m53.0s), 08/15 VUs, 26 complete and 0 interrupted iterations
default   [  29% ] 08/15 VUs  0m53.0s/3m00.0s

running (0m54.0s), 08/15 VUs, 27 complete and 0 interrupted iterations
default   [  30% ] 08/15 VUs  0m54.0s/3m00.0s

running (0m55.0s), 09/15 VUs, 30 complete and 0 interrupted iterations
default   [  31% ] 09/15 VUs  0m55.0s/3m00.0s

running (0m56.0s), 09/15 VUs, 31 complete and 0 interrupted iterations
default   [  31% ] 09/15 VUs  0m56.0s/3m00.0s

running (0m57.0s), 09/15 VUs, 32 complete and 0 interrupted iterations
default   [  32% ] 09/15 VUs  0m57.0s/3m00.0s

running (0m58.0s), 09/15 VUs, 34 complete and 0 interrupted iterations
default   [  32% ] 09/15 VUs  0m58.0s/3m00.0s

running (0m59.0s), 09/15 VUs, 34 complete and 0 interrupted iterations
default   [  33% ] 09/15 VUs  0m59.0s/3m00.0s

running (1m00.0s), 09/15 VUs, 35 complete and 0 interrupted iterations
default   [  33% ] 09/15 VUs  1m00.0s/3m00.0s

running (1m01.0s), 10/15 VUs, 37 complete and 0 interrupted iterations
default   [  34% ] 10/15 VUs  1m01.0s/3m00.0s

running (1m02.0s), 10/15 VUs, 41 complete and 0 interrupted iterations
default   [  34% ] 10/15 VUs  1m02.0s/3m00.0s

running (1m03.0s), 10/15 VUs, 42 complete and 0 interrupted iterations
default   [  35% ] 10/15 VUs  1m03.0s/3m00.0s

running (1m04.0s), 10/15 VUs, 42 complete and 0 interrupted iterations
default   [  36% ] 10/15 VUs  1m04.0s/3m00.0s

running (1m05.0s), 10/15 VUs, 44 complete and 0 interrupted iterations
default   [  36% ] 10/15 VUs  1m05.0s/3m00.0s

running (1m06.0s), 10/15 VUs, 46 complete and 0 interrupted iterations
default   [  37% ] 10/15 VUs  1m06.0s/3m00.0s

running (1m07.0s), 11/15 VUs, 48 complete and 0 interrupted iterations
default   [  37% ] 11/15 VUs  1m07.0s/3m00.0s

running (1m08.0s), 11/15 VUs, 50 complete and 0 interrupted iterations
default   [  38% ] 11/15 VUs  1m08.0s/3m00.0s

running (1m09.0s), 11/15 VUs, 50 complete and 0 interrupted iterations
default   [  38% ] 11/15 VUs  1m09.0s/3m00.0s

running (1m10.0s), 11/15 VUs, 52 complete and 0 interrupted iterations
default   [  39% ] 11/15 VUs  1m10.0s/3m00.0s

running (1m11.0s), 11/15 VUs, 53 complete and 0 interrupted iterations
default   [  39% ] 11/15 VUs  1m11.0s/3m00.0s

running (1m12.0s), 11/15 VUs, 57 complete and 0 interrupted iterations
default   [  40% ] 11/15 VUs  1m12.0s/3m00.0s

running (1m13.0s), 12/15 VUs, 60 complete and 0 interrupted iterations
default   [  41% ] 12/15 VUs  1m13.0s/3m00.0s

running (1m14.0s), 12/15 VUs, 61 complete and 0 interrupted iterations
default   [  41% ] 12/15 VUs  1m14.0s/3m00.0s

running (1m15.0s), 12/15 VUs, 63 complete and 0 interrupted iterations
default   [  42% ] 12/15 VUs  1m15.0s/3m00.0s

running (1m16.0s), 12/15 VUs, 64 complete and 0 interrupted iterations
default   [  42% ] 12/15 VUs  1m16.0s/3m00.0s

running (1m17.0s), 12/15 VUs, 64 complete and 0 interrupted iterations
default   [  43% ] 12/15 VUs  1m17.0s/3m00.0s

running (1m18.0s), 12/15 VUs, 69 complete and 0 interrupted iterations
default   [  43% ] 12/15 VUs  1m18.0s/3m00.0s

running (1m19.0s), 13/15 VUs, 69 complete and 0 interrupted iterations
default   [  44% ] 13/15 VUs  1m19.0s/3m00.0s

running (1m20.0s), 13/15 VUs, 69 complete and 0 interrupted iterations
default   [  44% ] 13/15 VUs  1m20.0s/3m00.0s

running (1m21.0s), 13/15 VUs, 70 complete and 0 interrupted iterations
default   [  45% ] 13/15 VUs  1m21.0s/3m00.0s

running (1m22.0s), 13/15 VUs, 70 complete and 0 interrupted iterations
default   [  46% ] 13/15 VUs  1m22.0s/3m00.0s

running (1m23.0s), 13/15 VUs, 73 complete and 0 interrupted iterations
default   [  46% ] 13/15 VUs  1m23.0s/3m00.0s

running (1m24.0s), 13/15 VUs, 77 complete and 0 interrupted iterations
default   [  47% ] 13/15 VUs  1m24.0s/3m00.0s

running (1m25.0s), 14/15 VUs, 79 complete and 0 interrupted iterations
default   [  47% ] 14/15 VUs  1m25.0s/3m00.0s

running (1m26.0s), 14/15 VUs, 80 complete and 0 interrupted iterations
default   [  48% ] 14/15 VUs  1m26.0s/3m00.0s

running (1m27.0s), 14/15 VUs, 82 complete and 0 interrupted iterations
default   [  48% ] 14/15 VUs  1m27.0s/3m00.0s

running (1m28.0s), 14/15 VUs, 84 complete and 0 interrupted iterations
default   [  49% ] 14/15 VUs  1m28.0s/3m00.0s

running (1m29.0s), 14/15 VUs, 87 complete and 0 interrupted iterations
default   [  49% ] 14/15 VUs  1m29.0s/3m00.0s

running (1m30.0s), 14/15 VUs, 89 complete and 0 interrupted iterations
default   [  50% ] 14/15 VUs  1m30.0s/3m00.0s

running (1m31.0s), 15/15 VUs, 91 complete and 0 interrupted iterations
default   [  51% ] 15/15 VUs  1m31.0s/3m00.0s

running (1m32.0s), 15/15 VUs, 93 complete and 0 interrupted iterations
default   [  51% ] 15/15 VUs  1m32.0s/3m00.0s

running (1m33.0s), 15/15 VUs, 94 complete and 0 interrupted iterations
default   [  52% ] 15/15 VUs  1m33.0s/3m00.0s

running (1m34.0s), 15/15 VUs, 97 complete and 0 interrupted iterations
default   [  52% ] 15/15 VUs  1m34.0s/3m00.0s

running (1m35.0s), 15/15 VUs, 98 complete and 0 interrupted iterations
default   [  53% ] 15/15 VUs  1m35.0s/3m00.0s

running (1m36.0s), 15/15 VUs, 102 complete and 0 interrupted iterations
default   [  53% ] 15/15 VUs  1m36.0s/3m00.0s

running (1m37.0s), 15/15 VUs, 103 complete and 0 interrupted iterations
default   [  54% ] 15/15 VUs  1m37.0s/3m00.0s

running (1m38.0s), 15/15 VUs, 104 complete and 0 interrupted iterations
default   [  54% ] 15/15 VUs  1m38.0s/3m00.0s

running (1m39.0s), 15/15 VUs, 107 complete and 0 interrupted iterations
default   [  55% ] 15/15 VUs  1m39.0s/3m00.0s

running (1m40.0s), 15/15 VUs, 108 complete and 0 interrupted iterations
default   [  56% ] 15/15 VUs  1m40.0s/3m00.0s

running (1m41.0s), 15/15 VUs, 109 complete and 0 interrupted iterations
default   [  56% ] 15/15 VUs  1m41.0s/3m00.0s

running (1m42.0s), 15/15 VUs, 113 complete and 0 interrupted iterations
default   [  57% ] 15/15 VUs  1m42.0s/3m00.0s

running (1m43.0s), 15/15 VUs, 114 complete and 0 interrupted iterations
default   [  57% ] 15/15 VUs  1m43.0s/3m00.0s

running (1m44.0s), 15/15 VUs, 120 complete and 0 interrupted iterations
default   [  58% ] 15/15 VUs  1m44.0s/3m00.0s

running (1m45.0s), 15/15 VUs, 121 complete and 0 interrupted iterations
default   [  58% ] 15/15 VUs  1m45.0s/3m00.0s

running (1m46.0s), 15/15 VUs, 123 complete and 0 interrupted iterations
default   [  59% ] 15/15 VUs  1m46.0s/3m00.0s

running (1m47.0s), 15/15 VUs, 124 complete and 0 interrupted iterations
default   [  59% ] 15/15 VUs  1m47.0s/3m00.0s

running (1m48.0s), 15/15 VUs, 126 complete and 0 interrupted iterations
default   [  60% ] 15/15 VUs  1m48.0s/3m00.0s

running (1m49.0s), 15/15 VUs, 127 complete and 0 interrupted iterations
default   [  61% ] 15/15 VUs  1m49.0s/3m00.0s

running (1m50.0s), 15/15 VUs, 128 complete and 0 interrupted iterations
default   [  61% ] 15/15 VUs  1m50.0s/3m00.0s

running (1m51.0s), 15/15 VUs, 133 complete and 0 interrupted iterations
default   [  62% ] 15/15 VUs  1m51.0s/3m00.0s

running (1m52.0s), 15/15 VUs, 135 complete and 0 interrupted iterations
default   [  62% ] 15/15 VUs  1m52.0s/3m00.0s

running (1m53.0s), 15/15 VUs, 137 complete and 0 interrupted iterations
default   [  63% ] 15/15 VUs  1m53.0s/3m00.0s

running (1m54.0s), 15/15 VUs, 138 complete and 0 interrupted iterations
default   [  63% ] 15/15 VUs  1m54.0s/3m00.0s

running (1m55.0s), 15/15 VUs, 142 complete and 0 interrupted iterations
default   [  64% ] 15/15 VUs  1m55.0s/3m00.0s

running (1m56.0s), 15/15 VUs, 144 complete and 0 interrupted iterations
default   [  64% ] 15/15 VUs  1m56.0s/3m00.0s

running (1m57.0s), 15/15 VUs, 145 complete and 0 interrupted iterations
default   [  65% ] 15/15 VUs  1m57.0s/3m00.0s

running (1m58.0s), 15/15 VUs, 145 complete and 0 interrupted iterations
default   [  66% ] 15/15 VUs  1m58.0s/3m00.0s

running (1m59.0s), 15/15 VUs, 147 complete and 0 interrupted iterations
default   [  66% ] 15/15 VUs  1m59.0s/3m00.0s

running (2m00.0s), 15/15 VUs, 151 complete and 0 interrupted iterations
default   [  67% ] 15/15 VUs  2m00.0s/3m00.0s

running (2m01.0s), 15/15 VUs, 154 complete and 0 interrupted iterations
default   [  67% ] 15/15 VUs  2m01.0s/3m00.0s

running (2m02.0s), 15/15 VUs, 155 complete and 0 interrupted iterations
default   [  68% ] 15/15 VUs  2m02.0s/3m00.0s

running (2m03.0s), 15/15 VUs, 155 complete and 0 interrupted iterations
default   [  68% ] 15/15 VUs  2m03.0s/3m00.0s

running (2m04.0s), 15/15 VUs, 159 complete and 0 interrupted iterations
default   [  69% ] 15/15 VUs  2m04.0s/3m00.0s

running (2m05.0s), 15/15 VUs, 161 complete and 0 interrupted iterations
default   [  69% ] 15/15 VUs  2m05.0s/3m00.0s

running (2m06.0s), 15/15 VUs, 163 complete and 0 interrupted iterations
default   [  70% ] 15/15 VUs  2m06.0s/3m00.0s

running (2m07.0s), 15/15 VUs, 164 complete and 0 interrupted iterations
default   [  71% ] 15/15 VUs  2m07.0s/3m00.0s

running (2m08.0s), 15/15 VUs, 168 complete and 0 interrupted iterations
default   [  71% ] 15/15 VUs  2m08.0s/3m00.0s

running (2m09.0s), 15/15 VUs, 170 complete and 0 interrupted iterations
default   [  72% ] 15/15 VUs  2m09.0s/3m00.0s

running (2m10.0s), 15/15 VUs, 171 complete and 0 interrupted iterations
default   [  72% ] 15/15 VUs  2m10.0s/3m00.0s

running (2m11.0s), 15/15 VUs, 175 complete and 0 interrupted iterations
default   [  73% ] 15/15 VUs  2m11.0s/3m00.0s

running (2m12.0s), 15/15 VUs, 177 complete and 0 interrupted iterations
default   [  73% ] 15/15 VUs  2m12.0s/3m00.0s

running (2m13.0s), 15/15 VUs, 180 complete and 0 interrupted iterations
default   [  74% ] 15/15 VUs  2m13.0s/3m00.0s

running (2m14.0s), 15/15 VUs, 183 complete and 0 interrupted iterations
default   [  74% ] 15/15 VUs  2m14.0s/3m00.0s

running (2m15.0s), 15/15 VUs, 184 complete and 0 interrupted iterations
default   [  75% ] 15/15 VUs  2m15.0s/3m00.0s

running (2m16.0s), 15/15 VUs, 185 complete and 0 interrupted iterations
default   [  76% ] 15/15 VUs  2m16.0s/3m00.0s

running (2m17.0s), 15/15 VUs, 185 complete and 0 interrupted iterations
default   [  76% ] 15/15 VUs  2m17.0s/3m00.0s

running (2m18.0s), 15/15 VUs, 187 complete and 0 interrupted iterations
default   [  77% ] 15/15 VUs  2m18.0s/3m00.0s

running (2m19.0s), 15/15 VUs, 191 complete and 0 interrupted iterations
default   [  77% ] 15/15 VUs  2m19.0s/3m00.0s

running (2m20.0s), 15/15 VUs, 194 complete and 0 interrupted iterations
default   [  78% ] 15/15 VUs  2m20.0s/3m00.0s

running (2m21.0s), 15/15 VUs, 195 complete and 0 interrupted iterations
default   [  78% ] 15/15 VUs  2m21.0s/3m00.0s

running (2m22.0s), 15/15 VUs, 198 complete and 0 interrupted iterations
default   [  79% ] 15/15 VUs  2m22.0s/3m00.0s

running (2m23.0s), 15/15 VUs, 199 complete and 0 interrupted iterations
default   [  79% ] 15/15 VUs  2m23.0s/3m00.0s

running (2m24.0s), 15/15 VUs, 201 complete and 0 interrupted iterations
default   [  80% ] 15/15 VUs  2m24.0s/3m00.0s

running (2m25.0s), 15/15 VUs, 205 complete and 0 interrupted iterations
default   [  81% ] 15/15 VUs  2m25.0s/3m00.0s

running (2m26.0s), 15/15 VUs, 206 complete and 0 interrupted iterations
default   [  81% ] 15/15 VUs  2m26.0s/3m00.0s

running (2m27.0s), 15/15 VUs, 208 complete and 0 interrupted iterations
default   [  82% ] 15/15 VUs  2m27.0s/3m00.0s

running (2m28.0s), 15/15 VUs, 210 complete and 0 interrupted iterations
default   [  82% ] 15/15 VUs  2m28.0s/3m00.0s

running (2m29.0s), 15/15 VUs, 212 complete and 0 interrupted iterations
default   [  83% ] 15/15 VUs  2m29.0s/3m00.0s

running (2m30.0s), 15/15 VUs, 214 complete and 0 interrupted iterations
default   [  83% ] 15/15 VUs  2m30.0s/3m00.0s

running (2m31.0s), 15/15 VUs, 216 complete and 0 interrupted iterations
default   [  84% ] 15/15 VUs  2m31.0s/3m00.0s

running (2m32.0s), 15/15 VUs, 217 complete and 0 interrupted iterations
default   [  84% ] 15/15 VUs  2m32.0s/3m00.0s

running (2m33.0s), 15/15 VUs, 218 complete and 0 interrupted iterations
default   [  85% ] 15/15 VUs  2m33.0s/3m00.0s

running (2m34.0s), 15/15 VUs, 221 complete and 0 interrupted iterations
default   [  86% ] 15/15 VUs  2m34.0s/3m00.0s

running (2m35.0s), 15/15 VUs, 223 complete and 0 interrupted iterations
default   [  86% ] 15/15 VUs  2m35.0s/3m00.0s

running (2m36.0s), 15/15 VUs, 225 complete and 0 interrupted iterations
default   [  87% ] 15/15 VUs  2m36.0s/3m00.0s

running (2m37.0s), 15/15 VUs, 228 complete and 0 interrupted iterations
default   [  87% ] 15/15 VUs  2m37.0s/3m00.0s

running (2m38.0s), 14/15 VUs, 229 complete and 0 interrupted iterations
default   [  88% ] 14/15 VUs  2m38.0s/3m00.0s

running (2m39.0s), 14/15 VUs, 230 complete and 0 interrupted iterations
default   [  88% ] 14/15 VUs  2m39.0s/3m00.0s

running (2m40.0s), 13/15 VUs, 232 complete and 0 interrupted iterations
default   [  89% ] 13/15 VUs  2m40.0s/3m00.0s

running (2m41.0s), 13/15 VUs, 233 complete and 0 interrupted iterations
default   [  89% ] 13/15 VUs  2m41.0s/3m00.0s

running (2m42.0s), 13/15 VUs, 236 complete and 0 interrupted iterations
default   [  90% ] 13/15 VUs  2m42.0s/3m00.0s

running (2m43.0s), 13/15 VUs, 236 complete and 0 interrupted iterations
default   [  91% ] 13/15 VUs  2m43.0s/3m00.0s

running (2m44.0s), 11/15 VUs, 239 complete and 0 interrupted iterations
default   [  91% ] 11/15 VUs  2m44.0s/3m00.0s

running (2m45.0s), 11/15 VUs, 240 complete and 0 interrupted iterations
default   [  92% ] 11/15 VUs  2m45.0s/3m00.0s

running (2m46.0s), 10/15 VUs, 243 complete and 0 interrupted iterations
default   [  92% ] 10/15 VUs  2m46.0s/3m00.0s

running (2m47.0s), 10/15 VUs, 244 complete and 0 interrupted iterations
default   [  93% ] 10/15 VUs  2m47.0s/3m00.0s

running (2m48.0s), 09/15 VUs, 245 complete and 0 interrupted iterations
default   [  93% ] 09/15 VUs  2m48.0s/3m00.0s

running (2m49.0s), 08/15 VUs, 247 complete and 0 interrupted iterations
default   [  94% ] 08/15 VUs  2m49.0s/3m00.0s

running (2m50.0s), 08/15 VUs, 247 complete and 0 interrupted iterations
default   [  94% ] 08/15 VUs  2m50.0s/3m00.0s

running (2m51.0s), 07/15 VUs, 249 complete and 0 interrupted iterations
default   [  95% ] 07/15 VUs  2m51.0s/3m00.0s

running (2m52.0s), 07/15 VUs, 250 complete and 0 interrupted iterations
default   [  96% ] 07/15 VUs  2m52.0s/3m00.0s

running (2m53.0s), 07/15 VUs, 250 complete and 0 interrupted iterations
default   [  96% ] 07/15 VUs  2m53.0s/3m00.0s

running (2m54.0s), 07/15 VUs, 251 complete and 0 interrupted iterations
default   [  97% ] 07/15 VUs  2m54.0s/3m00.0s

running (2m55.0s), 04/15 VUs, 254 complete and 0 interrupted iterations
default   [  97% ] 04/15 VUs  2m55.0s/3m00.0s

running (2m56.0s), 04/15 VUs, 255 complete and 0 interrupted iterations
default   [  98% ] 04/15 VUs  2m56.0s/3m00.0s

running (2m57.0s), 04/15 VUs, 255 complete and 0 interrupted iterations
default   [  98% ] 04/15 VUs  2m57.0s/3m00.0s

running (2m58.0s), 03/15 VUs, 256 complete and 0 interrupted iterations
default   [  99% ] 03/15 VUs  2m58.0s/3m00.0s

running (2m59.0s), 03/15 VUs, 257 complete and 0 interrupted iterations
default   [  99% ] 03/15 VUs  2m59.0s/3m00.0s

running (3m00.0s), 02/15 VUs, 258 complete and 0 interrupted iterations
default   [ 100% ] 02/15 VUs  3m00.0s/3m00.0s

running (3m01.0s), 01/15 VUs, 259 complete and 0 interrupted iterations
default Γåô [ 100% ] 02/15 VUs  3m0s

running (3m02.0s), 01/15 VUs, 259 complete and 0 interrupted iterations
default Γåô [ 100% ] 02/15 VUs  3m0s

running (3m03.0s), 01/15 VUs, 259 complete and 0 interrupted iterations
default Γåô [ 100% ] 02/15 VUs  3m0s

running (3m04.0s), 01/15 VUs, 259 complete and 0 interrupted iterations
default Γåô [ 100% ] 02/15 VUs  3m0s


  Γûê THRESHOLDS 

    http_req_duration
    Γ£ô 'p(95)<3000' p(95)=377.58ms

    http_req_failed
    Γ£ô 'rate<0.02' rate=0.00%

    journey_duration{journey:browse}
    Γ£ô 'p(95)<10000' p(95)=6.13s

    journey_duration{journey:compare}
    Γ£ô 'p(95)<25000' p(95)=15.28s

    journey_duration{journey:shop}
    Γ£ô 'p(95)<15000' p(95)=11.46s


  Γûê TOTAL RESULTS 

    checks_total.......: 928     5.035123/s
    checks_succeeded...: 100.00% 928 out of 928
    checks_failed......: 0.00%   0 out of 928

    Γ£ô home 200
    Γ£ô categories 200
    Γ£ô category 200
    Γ£ô product 200
    Γ£ô search 200
    Γ£ô compare 200

    CUSTOM
    journey_duration...............: avg=7.14s   min=3.47s    med=5.84s    max=15.4s    p(90)=11.08s   p(95)=12.8s   
      { journey:browse }...........: avg=5.02s   min=3.47s    med=5.03s    max=6.58s    p(90)=6.01s    p(95)=6.13s   
      { journey:compare }..........: avg=13.5s   min=10.81s   med=13.47s   max=15.4s    p(90)=15.18s   p(95)=15.28s  
      { journey:shop }.............: avg=9.35s   min=6.8s     med=9.13s    max=12.45s   p(90)=10.89s   p(95)=11.46s  

    HTTP
    http_req_duration..............: avg=198.3ms min=116.05ms med=143.92ms max=780.04ms p(90)=358.21ms p(95)=377.58ms
      { expected_response:true }...: avg=198.3ms min=116.05ms med=143.92ms max=780.04ms p(90)=358.21ms p(95)=377.58ms
    http_req_failed................: 0.00%  0 out of 928
    http_reqs......................: 928    5.035123/s

    EXECUTION
    iteration_duration.............: avg=7.14s   min=3.47s    med=5.84s    max=15.4s    p(90)=11.07s   p(95)=12.8s   
    iterations.....................: 260    1.410703/s
    vus............................: 1      min=1        max=15
    vus_max........................: 15     min=15       max=15

    NETWORK
    data_received..................: 27 MB  145 kB/s
    data_sent......................: 129 kB 702 B/s



running (3m04.3s), 00/15 VUs, 260 complete and 0 interrupted iterations
default Γ£ô [ 100% ] 00/15 VUs  3m0s